In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
import pandas as pd
import os
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
from matplotlib.ticker import FuncFormatter

In [12]:
names_dir = '/Users/taylo/desktop/baby_names/'
names_data_list =[]
names_columns = ['state', 'gender', 'year', 'name','babies']
for file in os.listdir(names_dir):
    if file.endswith('.TXT'):
        names_data = pd.read_csv(names_dir + file,header=None, names=names_columns)
        names_data_list.append(names_data)
    else:
        continue
names_data = pd.concat(names_data_list)

In [13]:
data = names_data[names_data['year'] >= 1950]

In [9]:
names_data.head()

  state gender  year      name  babies
0    AK      F  1910      Mary      14
1    AK      F  1910     Annie      12
2    AK      F  1910      Anna      10
3    AK      F  1910  Margaret       8
4    AK      F  1910     Helen       7

In [14]:
data.head()

     state gender  year      name  babies
1269    AK      F  1950      Mary      71
1270    AK      F  1950     Linda      68
1271    AK      F  1950   Barbara      46
1272    AK      F  1950  Patricia      38
1273    AK      F  1950     Susan      33

In [15]:
data.groupby('gender')['babies'].sum() / data['babies'].sum()

gender
F    0.470011
M    0.529989
Name: babies, dtype: float64

In [16]:
data.gender = data['gender']

C:\Users\taylo\AppData\Local\Temp\ipykernel_10192\321060875.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.gender = data['gender']

In [21]:
total_babies = data.babies.sum()
female_percent = data[data.gender=='F']['babies'].sum()/total_babies *100
male_percent = data[data.gender =='M']['babies'].sum()/total_babies *100

In [22]:
male_percent

52.99887076792776

In [25]:
most_popular_names = (
    data
    .groupby(['name', 'gender'])
    .babies
    .sum()
    .reset_index()
    .sort_values('babies', ascending=False)
)

In [26]:
most_popular_names[:5]

          name gender   babies
21483  Michael      M  3918662
13220    James      M  2902195
7440     David      M  2899746
14681     John      M  2755438
25319   Robert      M  2583575